sampleapp/app/controllers/comments_controller.rb

  def show
  	@comment = @post.comments.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 1))

  def create
  	@comment = @post.comments.build(params[:comment])
    if @comment.save
---
INSERT INTO `comments` (`commenter`, `body`, `post_id`, `created_at`, `updated_at`) VALUES('Jane', 'I am a commenter\r\n', 1, '2018-12-10 12:03:33', '2018-12-10 12:03:33')

  def edit
  	@comment = @post.comments.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 1))

  def update
  	@comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  	def find_comments
  		@post = Post.find(params[:post_id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)