sampleapp/app/controllers/hello_controller.rb

  def index
    @message = " "
    @username = params[:username]
    @password = params[:password]
    if session[:current_user_id] ==nil
      if @username.nil? || @username.empty? || @password.nil? || @password.empty?
        flash[:error] = "Username and/or password cannot be empty"
        render "login"
      else
        if @userId = Login.first(:conditions => "username ='"+ @username+"'")
        #@userId = Login.find(:username => @username)
          if @userId.password == @password
            @message = "Welcome "+@username
            session[:current_user_id] = @userId.id
          else
            flash[:error] = "Incorrect username or password"
            render "login"
          end
        else
          flash[:error] = "Incorrect username or password"
          redirect_to :action => "login"
        end
      end
    else
      @message = "Welcome "+ Login.find(session[:current_user_id]).username
---
SELECT * FROM `logins` WHERE (username ='divya') LIMIT 1
SELECT * FROM `logins` WHERE (`logins`.`id` = 1)