sampleapp/app/controllers/home_controller.rb

SELECT * FROM `logins` ORDER BY logins.id DESC LIMIT 1
SELECT * FROM `logins` WHERE (logins.id >= 0) ORDER BY logins.id ASC LIMIT 2
SELECT count(username) as username_count, date(created_at) as date FROM `logins` GROUP BY date(created_at)
---
  def index
  	@logins = Login.all
  	@logins = Login.first(:conditions => {:username => "janedoe1"})
  	@logins = Login.last
  	@logins = Login.all(:order => :username)
  	@logins = Login.all(:limit => 2)
  	@logins = Login.all(:group => "date(created_at)", :select =>"count(username) as username_count, date(created_at) as date")