sampleapp/app/controllers/logins_controller.rb

	def index
		  	@loginUsers = Login.all
---
SELECT * FROM `logins`

	def create
	    @login = Login.new(params[:login])
	    respond_to do |format|
	      if @login.save
---
INSERT INTO `logins` (`email`, `username`, `lock_version`, `password`, `created_at`, `updated_at`) VALUES('divyalatchum1i@gmail.com', 'divyalatchumi1', 0, 'divyalatchumi', '2018-12-14 06:00:04', '2018-12-14 06:00:04')

	def loginAuth
		@username = params[:username]
    	@password = params[:password]
    	#puts @username + " " + @password
		if @username.nil? || @username.empty? || @password.nil? || @password.empty?
			render :status => :not_implemented, :json => {:message => "Username and/or password cannot be empty"}
		else
			if @userId = Login.first(:conditions => "username ='"+ @username+"'")
---
SELECT * FROM `logins` WHERE (username ='a') LIMIT 1