sampleapp/app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `updated_at`, `login_id`, `content`, `name`, `title`) VALUES('2018-12-11 11:55:53', '2018-12-11 11:55:53', NULL, 'This is a sample post to test logger.debug()', 'John', 'Testing logger')
---
  def create
    @post = Post.new(params[:post])
    respond_to do |format|
      if @post.save

UPDATE `posts` SET `updated_at` = '2018-12-05 07:35:08', `content` = 'Another post without title or name for checking and editing' WHERE `id` = 1
---
  def update
    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM `posts` WHERE `id` = 2
---
  def destroy
    @post.destroy

SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
---
    def find_post
      @post = Post.find(params[:id])