sampleapp/app/controllers/tax_assessments_controller.rb

	def showAll
		@taxAssessment = TaxAssessment.all(:conditions => "logins_id =" + @current_user.to_s)
---
SELECT * FROM `tax_assessments` WHERE (logins_id =6)

	def update
		if params[:Itr_type].nil? || params[:profit].nil? || params[:revenue].nil? || params[:assessment_year].nil?
			render :status => :not_implemented, :json =>{:message => 'Fields cannot be empty'}

		elsif params[:AckNo].to_s.length<15
			render :status => :not_implemented, :json => {:message => 'Acknowledgement number must have 15 digits'}
		else
			@taxAssessment = TaxAssessment.find(params[:id])
			if @taxAssessment.update_attributes(:Itr_type => params[:Itr_type],
													:AckNo => params[:AckNo],
													:profit => params[:profit],
													:revenue => params[:revenue],
													:assessment_year => params[:assessment_year])
---
SELECT * FROM `tax_assessments` WHERE (`tax_assessments`.`id` = 11)
UPDATE `tax_assessments` SET `updated_at` = '2018-12-18 09:39:02', `AckNo` = 232354246364455 WHERE `id` = 11

	def getTaxAssessmentRecord
		@taxAssessment = TaxAssessment.find(params[:id])
---
SELECT * FROM `tax_assessments` WHERE (`tax_assessments`.`id` = 11)

	def taxAssessmentRecord
		if params[:Itr_type].nil? || params[:profit].nil? || params[:revenue].nil? || params[:assessment_year].nil?
			render :status => :not_implemented, :json =>{:message => 'Fields cannot be empty'}

		elsif params[:ack_no].nil?
			render :status => :not_implemented, :json => {:message => 'Acknowledgement number must have 15 digits'}
		else
			@taxAssessment = TaxAssessment.new(:Itr_type => params[:Itr_type],
												:AckNo => params[:ack_no],
												:profit => params[:profit],
												:revenue => params[:revenue],
												:assessment_year => params[:assessment_year],
												:logins_id => @current_user )
			if @taxAssessment.save
---
INSERT INTO `tax_assessments` (`created_at`, `AckNo`, `revenue`, `Itr_type`, `assessment_year`, `profit`, `updated_at`, `logins_id`) VALUES('2018-12-17 11:24:07', 136357345623634, 234.0, 'Itr-6s', 2015, 234.0, '2018-12-17 11:24:07', 1)

	def destroy
		@taxAssessment = TaxAssessment.find(params[:id])
		@taxAssessment.destroy
---
SELECT * FROM `tax_assessments` WHERE (`tax_assessments`.`id` = 3)
DELETE FROM `tax_assessments` WHERE `id` = 3